# Pandas Library tutorial by AKHADOV BILOL

## In this tutorial I will show you some fundamental elements of Pandas Library
## Pandas is a Python Library which is helpful to work with large datasets.
## I have included some questions to solve using Pandas Library elements

In [6]:
# First we need to import pandas library on our Jupyter Notebook. 

import pandas as pd     # Here 'pd' is a shortcut for pandas.

In [7]:
 dict1 = {'Name':['Bobur', 'Nastya', 'Islom', 'Sora', 'Mohir', 'Lola', 'Bilol'],
        'Scores':[98,89,99,87,90,83,99],
        'Gender':['male', 'female', 'male', 'female', 'male', 'female','male']
        }
df1=pd.DataFrame(dict1)
df1

## HERE I CREATED A PYTHON DICTIONARY WHICH CONTAINS STUDENT NAMES, TEST SCORES AND THEIR GENDERS
## THEN I ASSIGNED IT TO A NEW DATAFRAME CALLED "df1"

     Name  Scores  Gender
0   Bobur      98    male
1  Nastya      89  female
2   Islom      99    male
3    Sora      87  female
4   Mohir      90    male
5    Lola      83  female
6   Bilol      99    male

## 1. Display Top 3 rows of the Dataset

In [9]:
df1.head(3)

# head() method will display first 5 rows of your data by default. 
# But we need first 3 rows, so we need to write 3 inside parentheses after head

     Name  Scores  Gender
0   Bobur      98    male
1  Nastya      89  female
2   Islom      99    male

## 2. Check last 3 rows of the Dataset

In [10]:
df1.tail(3)

## we can use tail() method to show the last rows of our dataset

    Name  Scores  Gender
4  Mohir      90    male
5   Lola      83  female
6  Bilol      99    male

## 3. Find Shape of our Dataset (Number of rows and columns)

In [11]:
df1.shape

# 'shape' is not a METHOD but an ATTRIBUTE of our dataset so we dont need to put parentheses after it

(7, 3)

In [13]:
# Lets print out how many rows and columns we have in our dataset
print(f'Number of rows: {df1.shape[0]}')
print(f'Number of columns: {df1.shape[1]}')

Number of rows: 7
Number of columns: 3

## 4. Get information about the Dataset such as Total num of rows and columns, Datatypes of Each column and Memory

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Scores  7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

## 5. Check Null values in the Dataset

In [15]:
df1.isnull()
## this method will show boolean values. False if it is not a Null value, True if it is.

    Name  Scores  Gender
0  False   False   False
1  False   False   False
2  False   False   False
3  False   False   False
4  False   False   False
5  False   False   False
6  False   False   False

## 6. Get overall Statistics of the Dataset

In [16]:
df1.describe()

## I used describe() method to get the statistics of the dataset
## As you can see it will show you count,mean,std,min aggregates of the dataset

          Scores
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

## 7. Find unique values from the Gender column

In [17]:
df1

     Name  Scores  Gender
0   Bobur      98    male
1  Nastya      89  female
2   Islom      99    male
3    Sora      87  female
4   Mohir      90    male
5    Lola      83  female
6   Bilol      99    male

In [18]:
df1['Gender'].unique()

## we have 2 unique values in Gender column

array(['male', 'female'], dtype=object)

## 8. Display Count of Unique values in Gender Column

In [19]:
df1['Gender'].value_counts()

## value_counts() method helps you count the amount of unique values in a particular column

male      4
female    3
Name: Gender, dtype: int64

## 9. Find Total number of Students whose scores between 90 and 100
## using BETWEEN() method

In [32]:
df1['Scores'].between(90, 100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Scores, dtype: bool

In [33]:
## True values satisfy the requirement, in order to count their amount I will use sum() function

sum(df1['Scores'].between(90, 100))

4

In [29]:
df1[(df1['Scores']>=90) & (df1['Scores']<=100)]

## another method to solve the same problem

    Name  Scores Gender
0  Bobur      98   male
2  Islom      99   male
4  Mohir      90   male
6  Bilol      99   male

## 10. Find Average Scores, Minimum scores, Maximum scores.

In [34]:
df1['Scores'].mean()

92.14285714285714

In [35]:
df1['Scores'].min()

83

In [36]:
df1['Scores'].max()

99

## 11. Apply method

In [39]:
# Lets say we want to divide all the values in SCORES column by 2. First we will define a function which divides by 2
# Then input our function into apply(FUNCTION) method
def scores(x):
    return x/2

In [41]:
df1['Half_scores']=df1['Scores'].apply(scores)

In [42]:
df1

# as you can see half marks column was added at the end

     Name  Scores  Gender  Half_scores
0   Bobur      98    male         49.0
1  Nastya      89  female         44.5
2   Islom      99    male         49.5
3    Sora      87  female         43.5
4   Mohir      90    male         45.0
5    Lola      83  female         41.5
6   Bilol      99    male         49.5

In [43]:
## There is another way to solve this problem using LAMBDA function
df1['Scores'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Scores, dtype: float64

## 12. Map function

In [46]:
## I would like to change the Male and Female values to 1 and 0. In this case we can use map() function

df1['Gender_binary']=df1['Gender'].map({'male':1, 'female':0})

In [47]:
df1

     Name  Scores  Gender  Half_scores  Gender_binary
0   Bobur      98    male         49.0              1
1  Nastya      89  female         44.5              0
2   Islom      99    male         49.5              1
3    Sora      87  female         43.5              0
4   Mohir      90    male         45.0              1
5    Lola      83  female         41.5              0
6   Bilol      99    male         49.5              1

## 14. Drop Column(s)

In [48]:
## I want to eliminate Half_score and Gender_binary columns
df1.drop(['Half_scores', 'Gender_binary'],axis=1)

     Name  Scores  Gender
0   Bobur      98    male
1  Nastya      89  female
2   Islom      99    male
3    Sora      87  female
4   Mohir      90    male
5    Lola      83  female
6   Bilol      99    male

## 15. Print the name of the columns

In [49]:
df1.columns

Index(['Name', 'Scores', 'Gender', 'Half_scores', 'Gender_binary'], dtype='object')

## 16. Sort the Dataframe according to highest or lowest scores

In [51]:
df1.sort_values(by='Scores')

     Name  Scores  Gender  Half_scores  Gender_binary
5    Lola      83  female         41.5              0
3    Sora      87  female         43.5              0
1  Nastya      89  female         44.5              0
4   Mohir      90    male         45.0              1
0   Bobur      98    male         49.0              1
2   Islom      99    male         49.5              1
6   Bilol      99    male         49.5              1

In [52]:
## If I want to sort from highest to lowest I should add 'ascending=False' at the end

df1.sort_values(by='Scores',ascending=False)

     Name  Scores  Gender  Half_scores  Gender_binary
2   Islom      99    male         49.5              1
6   Bilol      99    male         49.5              1
0   Bobur      98    male         49.0              1
4   Mohir      90    male         45.0              1
1  Nastya      89  female         44.5              0
3    Sora      87  female         43.5              0
5    Lola      83  female         41.5              0

## 17. Display only Female students

In [56]:
df1[df1['Gender']=='female'][['Name','Scores']]

     Name  Scores
1  Nastya      89
3    Sora      87
5    Lola      83

In [58]:
## another method to do this is by using isin() method

df1[df1['Gender'].isin(['female'])]

     Name  Scores  Gender  Half_scores  Gender_binary
1  Nastya      89  female         44.5              0
3    Sora      87  female         43.5              0
5    Lola      83  female         41.5              0

# I hope you understood everything in this material. In case if you 
# have any questions contact me